# 2. Создайте список четных чисел от 1 до 50.
itogo = [x for x in range(1, 51) if x % 2 == 0]
print("Четные числа от 1 до 50:", itogo)