# 3. Создайте список нечетных чисел от 1 до 50.
itogo = [x for x in range(1, 51) if x % 2 != 0]
print("Нечетные числа от 1 до 50:", itogo)
