# 9. Создайте список чисел от 1 до 10, возведенных в третью степень.
itogo = [x**3 for x in range(1, 11)]
print("Числа от 1 до 10, возведенные в третью степень:", itogo)