# 4. Создайте список, содержащий числа от 1 до 20, умноженные на 2.
itogo = [x * 2 for x in range(1, 21)]
print("Числа от 1 до 20, умноженные на 2:", itogo)